Revit 2027 API
ReinforcementSettings.HostStructuralRebar Property
 Host Structural Rebar within Area and Path Reinforcement with touching AtomHostStructuralRebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HostStructuralRebar { get; set; }
Public Property HostStructuralRebar As Boolean
	Get
	Set
public:
property bool HostStructuralRebar {
	bool get ();
	void set (bool value);
}
member HostStructuralRebar : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: Cannot change the RebarShapeDefinesHooks property in these settings because the document contains one or more AreaReinforcement or PathReinforcement elements.
See Also
Reference
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace